0/fuel/Q
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fuel";
    object      Q;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -3 0 0 0 0 ];

internalField   nonuniform List<scalar> 
181195
(
1.88047e+06
3.59557e+06
5.18035e+06
6.65914e+06
8.04215e+06
9.33539e+06
1.05409e+07
1.16586e+07
...
)
;

boundaryField
{
    parede
    {
        type            calculated;
    }
    extremos
    {
        type            calculated;
    }
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }
    fuel_to_cladding
    {
        type            calculated;
    }
}


// ************************************************************************* //
