constant/coolant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/coolant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


4
(
inlet
{
    type            patch;
    physicalType    patch;
    nFaces          3136;
    startFace       315644;
}

parede
{
    type            symmetry;
    physicalType    symmetry;
    inGroups        1 ( symmetry );
    nFaces          4480;
    startFace       318780;
}

outlet
{
    type            patch;
    physicalType    patch;
    nFaces          3136;
    startFace       323260;
}

coolant_to_cladding
{
    type            mappedWall;
    inGroups        1 ( wall );
    nFaces          16520;
    startFace       326396;
    sampleMode      nearestPatchFace;
    sampleRegion    cladding;
    samplePatch     cladding_to_coolant;
}

)


// ************************************************************************* //
