constant/coolant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst; 
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

dpdt            no; 

mixture
{
    specie
    {
        nMoles          1;
        molWeight       18.02; 
    }

    transport
    {
      mu              797e-6;
      Pr              5.41;
     }

   thermodynamics
    {
      Cp              4180;
      Hf              0; 
    }

   equationOfState
    {
      rho      995;
      pRef     1e5;
    }
}


// ************************************************************************* //
