constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    extremos
    {
        type            patch;
        physicalType    patch;
        nFaces          13538;
        startFace       1027880;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          3136;
        startFace       1041418;
    }
    parede
    {
        type            symmetry;
        physicalType    symmetry;
        nFaces          4480;
        startFace       1044554;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          3136;
        startFace       1049034;
    }
)

// ************************************************************************* //
