system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fields to be probed. runTime modifiable!
// To run this file, type "probeLocations" in the solver directory

fields
(
    T
);

// Locations to be probed. runTime modifiable!
probeLocations
(
 (0.0075 0.0025 0.716)
 (0.0175 0.0025 0.716)
 (0.0375 0.0025 0.716)
 (0.0425 0.0025 0.716)
 (0.0475 0.0025 0.716)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
